# CTEs Products Lab

### Introduction

In this lesson, we'll practice working with CTEs.  As we know CTEs allow to break our queries into multiple steps by creating a temporary table.  And we performÂ our CTEs with the following syntax:

```SQL
WITH table_name AS (
   SELECT ...
)

SELECT ... FROM table_name;
```

Ok, let's get started.

### Getting set up

In this lesson we'll work with the northwind database, which is a sample ecommerce database.

We'll start by connecting to the database.

In [1]:
import sqlite3
conn = sqlite3.connect('Northwind_small.sqlite')
cursor = conn.cursor()

And then can see the various tables with the following.

In [3]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
cursor.fetchall()

[('Employee',),
 ('Category',),
 ('Customer',),
 ('Shipper',),
 ('Supplier',),
 ('Order',),
 ('Product',),
 ('OrderDetail',),
 ('CustomerCustomerDemo',),
 ('CustomerDemographic',),
 ('Region',),
 ('Territory',),
 ('EmployeeTerritory',)]

Now we we'll only use a subset of the above tables -- focusing on the `Product`, `Supplier` and `Category` table.  Ok, let's take a look at those tables.

In [7]:
import pandas as pd
pd.read_sql('SELECT * FROM Product LIMIT 2;', conn)

,Id,ProductName,SupplierId,CategoryId,QuantityPerUnit,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued
0,1,Chai,1,1,10 boxes x 20 bags,18,39,0,10,0
1,2,Chang,1,1,24 - 12 oz bottles,19,17,40,25,0

In [25]:
pd.read_sql("SELECT * FROM supplier LIMIT 2;", conn)

,Id,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax,HomePage
0,1,Exotic Liquids,Charlotte Cooper,Purchasing Manager,49 Gilbert St.,London,British Isles,EC1 4SD,UK,(171) 555-2222,None,None
1,2,New Orleans Cajun Delights,Shelley Burke,Order Administrator,P.O. Box 78934,New Orleans,North America,70117,USA,(100) 555-4822,None,#CAJUN.HTM#

In [26]:
pd.read_sql("SELECT * FROM category LIMIT 2;", conn)

   Id CategoryName                                        Description
0   1    Beverages        Soft drinks, coffees, teas, beers, and ales
1   2   Condiments  Sweet and savory sauces, relishes, spreads, an...

### Our First CTEs

Ok, now it's time to write our first CTE.  Let's use a CTE to find the highest average unit price by category and supplier.

In doing so first create a temporary table called `avg_category_supplier` that computes the average unit prices, and then find the category and supplier combination with the highest average price.

In [23]:
sql = """

"""

In [24]:
pd.read_sql(sql, conn)

# CategoryId	SupplierId	highest_avg_price
# 0	1	18	140.75

   CategoryId  SupplierId  highest_avg_price
0           1          18             140.75

Now let's use a CTE to find just the category with the lowest average price.

In [92]:
sql = """

"""

In [93]:
pd.read_sql(sql, conn)

# 	CategoryId	lowest_avg_price
# 0	5	20.25

   CategoryId  lowest_avg_price
0           5             20.25

Ok, so in this section, we used CTEs to perform multiple aggregations.  We did so by using CTEs to perform an initial aggregation in a temporary table, and then queried from that temporary table.

### CTEs for Preprocessing

Another use case for CTEs in queries is when joining together multiple tables.  Remember that in general, when coding, we often perform some initial pre-processing, and then act on that preprocessed data.  With CTEs, this may mean using temporary tables to first selecting just the columns that we need from a couple individual tables, and then performing the query from there.

For example, if we want to find the different categories of products made in the `British Isles` we only need a few columns from each table.  So we'll use CTEs to first select columns from each of those individual tables, and then from there combine these temporary tables together.

In [94]:
pd.read_sql("SELECT * FROM supplier LIMIT 2;", conn)

,Id,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax,HomePage
0,1,Exotic Liquids,Charlotte Cooper,Purchasing Manager,49 Gilbert St.,London,British Isles,EC1 4SD,UK,(171) 555-2222,None,None
1,2,New Orleans Cajun Delights,Shelley Burke,Order Administrator,P.O. Box 78934,New Orleans,North America,70117,USA,(100) 555-4822,None,#CAJUN.HTM#

In [74]:
sql = """
WITH select_supplier as (
    SELECT Id, CompanyName, Region FROM supplier
), 

select_category as (
    SELECT Id, CategoryName as name FROM Category
),

select_product as (
        SELECT SupplierId, CategoryId, UnitPrice FROM Product
)

SELECT * FROM select_product 
JOIN select_supplier ON select_product.SupplierId = select_supplier.Id
JOIN select_category ON select_product.CategoryId = select_category.Id
WHERE Region = 'British Isles';"""

In [75]:
pd.read_sql(sql, conn)

,SupplierId,CategoryId,UnitPrice,Id,CompanyName,Region,Id,name
0,1,1,18.0,1,Exotic Liquids,British Isles,1,Beverages
1,1,1,19.0,1,Exotic Liquids,British Isles,1,Beverages
2,1,2,10.0,1,Exotic Liquids,British Isles,2,Condiments
3,8,3,9.2,8,"Specialty Biscuits, Ltd.",British Isles,3,Confections
4,8,3,81.0,8,"Specialty Biscuits, Ltd.",British Isles,3,Confections
5,8,3,10.0,8,"Specialty Biscuits, Ltd.",British Isles,3,Confections
6,8,3,12.5,8,"Specialty Biscuits, Ltd.",British Isles,3,Confections

So we can see that we the products made in the British Isles are Beverages, Condiments and Confections.

Now, take another look at the CTE above.  Notice that there is only a single `WITH` statement, and we separate each temporary table by a comma.

```SQL
WITH select_supplier as (
    SELECT Id, CompanyName, Region FROM supplier
), 

select_category as ( ...
```

Ok, so now it's your turn to practice with using CTEs in this pattern.  Use CTEs to find the the average product price per city, and order from most highest product price to lowest.

So the first step is to use CTEs to select just the necessary columns from each of the needed tables.  And then from there we can join the tables together and perform the aggregation.

In [84]:
sql = """

"""

In [85]:
pd.read_sql(sql, conn)

# 	City	avg_price
# 0	Paris	140.750
# 1	Tokyo	46.000
# 2	Frankfurt	44.678
# 3	Annecy	44.500
# 4	Ste-Hyacinthe	38.900

            City  avg_price
0          Paris    140.750
1          Tokyo     46.000
2      Frankfurt     44.678
3         Annecy     44.500
4  Ste-Hyacinthe     38.900

### Summary

In this lesson we practiced using CTEs.  We use CTEs to create one or more temporary tables, and we then query from those tables.  We saw two use cases for CTEs.  With the first one, we use CTEs when chaining aggregate queries.

And with the second one, we used the temporary tables for a sort of pre-processing on each table, before then joining these tables together.  We separated each of the temporary tables with a comma.

```sql
WITH select_supplier as (
    SELECT Id, CompanyName, Region FROM supplier
), 

select_category as ( ...
```